class UserData:
    user_petr = {
        "name": "Петр",
        "surname": "Петров",
        "address": "Москва, ул. Ленина, д. 2",
        "phone": "+78888888888",
        "metro_station": "Курская",
        "date": "09.09.2026",
        "color": "black"
    }

    user_ivan = {
        "name": "Иван",
        "surname": "Иванов",
        "address": "Москва, ул. Пушкина, д. 1",
        "phone": "+79999999999",
        "metro_station": "Черкизовская",
        "date": "10.09.2026",
        "color": "grey"
    }

class TextDataMainPage:
    question_1 = "Сколько это стоит? И как оплатить?"
    answer_1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    question_2 = "Хочу сразу несколько самокатов! Так можно?"
    answer_2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    answer_3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    answer_4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    answer_5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    answer_6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    answer_7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    answer_8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."

class TextDataOrderPage:
    order_confirmation_text = "Заказ оформлен"
    